In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.3'

In [1]:
import pandas as pd

# Read the first 100 rows of the gzipped CSV file
df = pd.read_csv('green_tripdata_2019-09.csv.gz')

# Display the first few rows of the DataFrame
print(df.head())

   VendorID lpep_pickup_datetime lpep_dropoff_datetime store_and_fwd_flag  \
0       2.0  2019-09-01 00:10:53   2019-09-01 00:23:46                  N
1       2.0  2019-09-01 00:31:22   2019-09-01 00:44:37                  N
2       2.0  2019-09-01 00:50:24   2019-09-01 01:03:20                  N
3       2.0  2019-09-01 00:27:06   2019-09-01 00:33:22                  N
4       2.0  2019-09-01 00:43:23   2019-09-01 00:59:54                  N

   RatecodeID  PULocationID  DOLocationID  passenger_count  trip_distance  \
0         1.0            65           189              5.0           2.00
1         1.0            97           225              5.0           3.20
2         1.0            37            61              5.0           2.99
3         1.0           145           112              1.0           1.73
4         1.0           112           198              1.0           3.42

   fare_amount  extra  mta_tax  tip_amount  tolls_amount  ehail_fee  \
0         10.5    0.5      0.5        2.36           0.0        NaN
1         12.0    0.5      0.5        0.00           0.0        NaN
2         12.0    0.5      0.5        0.00           0.0        NaN
3          7.5    0.5      0.5        1.50           0.0        NaN
4         14.0    0.5      0.5        3.06           0.0        NaN

   improvement_surcharge  total_amount  payment_type  trip_type  \
0                    0.3         14.16           1.0        1.0
1                    0.3         13.30           2.0        1.0
2                    0.3         13.30           2.0        1.0
3                    0.3         10.30           1.0        1.0
4                    0.3         18.36           1.0        1.0

   congestion_surcharge
0                   0.0
1                   0.0
2                   0.0
3                   0.0
4                   0.0

/tmp/ipykernel_19397/3936354739.py:4: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('green_tripdata_2019-09.csv.gz')

In [2]:
df.describe()

,VendorID,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
count,389920.000000,389920.000000,449063.000000,449063.000000,389920.000000,449063.000000,449063.000000,449063.000000,449063.000000,449063.000000,449063.000000,0.0,449063.000000,449063.000000,389920.000000,389920.000000,389920.000000
mean,1.837777,1.106971,108.139203,130.154678,1.311900,3.519991,15.491455,0.697539,0.484626,1.037571,0.312411,NaN,0.253791,18.624612,1.456383,1.024685,0.439440
std,0.368656,0.723302,71.025032,76.577260,0.969761,4.083097,13.561680,1.022319,0.097407,2.261574,1.416886,NaN,0.110241,15.243472,0.522117,0.155162,1.007679
min,1.000000,1.000000,1.000000,1.000000,0.000000,0.000000,-200.000000,-4.500000,-0.500000,-3.890000,-15.400000,NaN,-0.300000,-200.000000,1.000000,1.000000,-2.750000
25%,2.000000,1.000000,56.000000,65.000000,1.000000,1.100000,7.000000,0.000000,0.500000,0.000000,0.000000,NaN,0.300000,8.800000,1.000000,1.000000,0.000000
50%,2.000000,1.000000,82.000000,129.000000,1.000000,2.090000,11.000000,0.500000,0.500000,0.000000,0.000000,NaN,0.300000,13.550000,1.000000,1.000000,0.000000
75%,2.000000,1.000000,166.000000,195.000000,1.000000,4.220000,20.000000,1.000000,0.500000,1.660000,0.000000,NaN,0.300000,24.050000,2.000000,1.000000,0.000000
max,2.000000,99.000000,265.000000,265.000000,9.000000,341.640000,1761.000000,8.250000,17.330000,400.000000,33.240000,NaN,0.300000,1762.800000,5.000000,2.000000,2.750000

In [4]:
from sqlalchemy import create_engine

In [5]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [5]:
df_iter = pd.read_csv('green_tripdata_2019-09.csv.gz', iterator=True, chunksize=100000)

In [7]:
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

In [9]:
# Initialize a counter for the total number of trips
# why this answer is wrong??
total_trips = 0

# Process each chunk
for chunk in df_iter:
    # Filter rows where pickup and dropoff dates are on 2019-09-18
    filtered_chunk = chunk[
        (pd.to_datetime(chunk['lpep_pickup_datetime']).dt.date == pd.to_datetime('2019-09-01').date()) &
        (pd.to_datetime(chunk['lpep_dropoff_datetime']).dt.date == pd.to_datetime('2019-09-01').date())
    ]
    # Add the count of filtered rows to the total
    total_trips += len(filtered_chunk)

# Print the result
print(f"Total taxi trips on 2019-09-18: {total_trips}")

Total taxi trips on 2019-09-18: 0

In [13]:
# Create the table schema
df.head(n=0).to_sql(name='green_taxi_data', con=engine, if_exists='replace')

0

In [15]:
# Load the actual data into the table
df.to_sql(name='green_taxi_data', con=engine, index=False, if_exists='replace')

63

In [16]:
query = """
SELECT * FROM green_taxi_data limit 10
"""

pd.read_sql(query, con=engine)

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2.0,2019-09-01 00:10:53,2019-09-01 00:23:46,N,1.0,65,189,5.0,2.00,10.5,0.5,0.5,2.36,0.00,None,0.3,14.16,1.0,1.0,0.0
1,2.0,2019-09-01 00:31:22,2019-09-01 00:44:37,N,1.0,97,225,5.0,3.20,12.0,0.5,0.5,0.00,0.00,None,0.3,13.30,2.0,1.0,0.0
2,2.0,2019-09-01 00:50:24,2019-09-01 01:03:20,N,1.0,37,61,5.0,2.99,12.0,0.5,0.5,0.00,0.00,None,0.3,13.30,2.0,1.0,0.0
3,2.0,2019-09-01 00:27:06,2019-09-01 00:33:22,N,1.0,145,112,1.0,1.73,7.5,0.5,0.5,1.50,0.00,None,0.3,10.30,1.0,1.0,0.0
4,2.0,2019-09-01 00:43:23,2019-09-01 00:59:54,N,1.0,112,198,1.0,3.42,14.0,0.5,0.5,3.06,0.00,None,0.3,18.36,1.0,1.0,0.0
5,2.0,2019-09-01 00:55:37,2019-09-01 01:17:02,N,1.0,7,41,1.0,6.26,21.0,0.5,0.5,0.00,6.12,None,0.3,28.42,2.0,1.0,0.0
6,2.0,2019-09-01 00:28:55,2019-09-01 00:52:09,N,1.0,33,37,1.0,4.34,18.0,0.5,0.5,3.86,0.00,None,0.3,23.16,1.0,1.0,0.0
7,1.0,2019-09-01 00:03:13,2019-09-01 00:03:32,N,1.0,55,55,1.0,1.20,2.5,0.5,0.5,0.00,0.00,None,0.3,3.80,3.0,1.0,0.0
8,1.0,2019-09-01 00:15:28,2019-09-01 00:43:22,N,1.0,55,89,1.0,0.00,22.2,0.0,0.5,0.00,0.00,None,0.3,23.00,1.0,1.0,0.0
9,2.0,2019-09-01 00:29:16,2019-09-01 00:30:15,N,1.0,17,17,1.0,0.14,2.5,0.5,0.5,0.00,0.00,None,0.3,3.80,2.0,1.0,0.0

In [18]:
# Question 3. Count records
# How many taxi trips were totally made on September 18th 2019?

query = """
SELECT COUNT(*) AS total_trips
FROM green_taxi_data
WHERE DATE(lpep_pickup_datetime) = '2019-09-18'
  AND DATE(lpep_dropoff_datetime) = '2019-09-18';
"""

pd.read_sql(query, con=engine)

   total_trips
0        15612

In [ ]:
# Question 4. Longest trip for each day
# Which was the pick up day with the longest trip distance? Use the pick up time for your calculations.
# Tip: For every trip on a single day, we only care about the trip with the longest distance.

query = """
WITH daily_longest_trips AS (
    SELECT 
        DATE(lpep_pickup_datetime) AS pickup_date,
        MAX(trip_distance) AS max_trip_distance
    FROM 
        green_tripdata_2019
    GROUP BY 
        DATE(lpep_pickup_datetime)
)
SELECT 
    pickup_date,
    max_trip_distance
FROM 
    daily_longest_trips
ORDER BY 
    max_trip_distance DESC
LIMIT 1;
"""

pd.read_sql(query, con=engine)

  pickup_date  max_trip_distance
0  2019-09-26             341.64

In [ ]:
# Question 5. Three biggest pick up Boroughs
# Consider lpep_pickup_datetime in '2019-09-18' and ignoring Borough has Unknown
# Which were the 3 pick up Boroughs that had a sum of total_amount superior to 50000?

query = """
select * 
FROM green_tripdata_2019
where DATE(lpep_pickup_datetime) = '2019-09-18'
"""

pd.read_sql(query, con=engine)

In [6]:
import pandas as pd

In [7]:
# Get taxi_zone_lookup
df_taxi_zone = pd.read_csv('taxi_zone_lookup.csv')

In [ ]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [13]:
# Create the table schema
df_taxi_zone.head(n=0).to_sql(name='taxi_zone', con=engine, if_exists='replace')

0

In [15]:
# Load the actual data into the table
df_taxi_zone.to_sql(name='taxi_zone', con=engine, index=False, if_exists='replace')

265

In [9]:
query = """
SELECT * FROM taxi_zone limit 10
"""

pd.read_sql(query, con=engine)

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone
5           6  Staten Island  Arrochar/Fort Wadsworth    Boro Zone
6           7         Queens                  Astoria    Boro Zone
7           8         Queens             Astoria Park    Boro Zone
8           9         Queens               Auburndale    Boro Zone
9          10         Queens             Baisley Park    Boro Zone

In [16]:
query = """
SELECT * FROM green_taxi_data limit 5
"""

pd.read_sql(query, con=engine)

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2.0,2019-09-01 00:10:53,2019-09-01 00:23:46,N,1.0,65,189,5.0,2.00,10.5,0.5,0.5,2.36,0.0,None,0.3,14.16,1.0,1.0,0.0
1,2.0,2019-09-01 00:31:22,2019-09-01 00:44:37,N,1.0,97,225,5.0,3.20,12.0,0.5,0.5,0.00,0.0,None,0.3,13.30,2.0,1.0,0.0
2,2.0,2019-09-01 00:50:24,2019-09-01 01:03:20,N,1.0,37,61,5.0,2.99,12.0,0.5,0.5,0.00,0.0,None,0.3,13.30,2.0,1.0,0.0
3,2.0,2019-09-01 00:27:06,2019-09-01 00:33:22,N,1.0,145,112,1.0,1.73,7.5,0.5,0.5,1.50,0.0,None,0.3,10.30,1.0,1.0,0.0
4,2.0,2019-09-01 00:43:23,2019-09-01 00:59:54,N,1.0,112,198,1.0,3.42,14.0,0.5,0.5,3.06,0.0,None,0.3,18.36,1.0,1.0,0.0

In [33]:
# Ensure the Table Names Are Correct
query = """
SELECT table_name FROM information_schema.tables WHERE table_schema = 'public';
"""

pd.read_sql(query, con=engine)

             table_name
0  yellow_tripdata_trip
1      yellow_taxi_data
2             taxi_zone
3       green_taxi_data

In [26]:
from sqlalchemy import text

In [32]:
# If you're using a transactional database (e.g., PostgreSQL), the DROP TABLE command might require a commit to finalize the changes.
with engine.connect() as conn:
    conn.execute(text("DROP TABLE IF EXISTS green_tripdata_2019_2"))
    conn.commit()  # Ensure changes are saved

In [19]:
query = """
SELECT column_name, data_type, is_nullable
FROM information_schema.columns
WHERE table_name = 'green_taxi_data';
"""

pd.read_sql(query, con=engine)

              column_name                    data_type is_nullable
0    congestion_surcharge             double precision         YES
1    lpep_pickup_datetime  timestamp without time zone         YES
2   lpep_dropoff_datetime  timestamp without time zone         YES
3                VendorID             double precision         YES
4              RatecodeID             double precision         YES
5            PULocationID                       bigint         YES
6            DOLocationID                       bigint         YES
7         passenger_count             double precision         YES
8           trip_distance             double precision         YES
9             fare_amount             double precision         YES
10                  extra             double precision         YES
11                mta_tax             double precision         YES
12             tip_amount             double precision         YES
13           tolls_amount             double precision         YES
14              ehail_fee             double precision         YES
15  improvement_surcharge             double precision         YES
16           total_amount             double precision         YES
17           payment_type             double precision         YES
18              trip_type             double precision         YES
19     store_and_fwd_flag                         text         YES

In [21]:
query = """
SELECT column_name, data_type, is_nullable
FROM information_schema.columns
WHERE table_name = 'taxi_zone';
"""

pd.read_sql(query, con=engine)

    column_name data_type is_nullable
0    LocationID    bigint         YES
1       Borough      text         YES
2          Zone      text         YES
3  service_zone      text         YES

In [35]:
# Case Sensitivity in PostgreSQL
# Since PULocationID uses uppercase letters, you must wrap it in double quotes ("PULocationID") in your SQL query. PostgreSQL is case-sensitive for identifiers.

query = """
SELECT a."PULocationID", b."Borough", SUM(a.total_amount) AS total_revenue
FROM green_taxi_data a
LEFT JOIN taxi_zone b ON a."PULocationID" = b."LocationID"
where DATE(lpep_pickup_datetime) = '2019-09-18'
GROUP BY a."PULocationID", b."Borough"
ORDER BY total_revenue DESC;
"""

pd.read_sql(query, con=engine)

     PULocationID        Borough  total_revenue
0              74      Manhattan       17893.06
1              75      Manhattan       17152.16
2             166      Manhattan       11259.68
3             244      Manhattan        9587.63
4              41      Manhattan        9573.44
..            ...            ...            ...
227            59          Bronx          16.80
228             4      Manhattan          16.71
229            23  Staten Island          12.00
230           158      Manhattan          11.80
231           207         Queens           3.80

[232 rows x 3 columns]

In [36]:
query = """
SELECT b."Borough", SUM(a.total_amount) AS total_revenue
FROM green_taxi_data a
LEFT JOIN taxi_zone b ON a."PULocationID" = b."LocationID"
where DATE(lpep_pickup_datetime) = '2019-09-18'
GROUP BY b."Borough"
ORDER BY total_revenue DESC;
"""

pd.read_sql(query, con=engine)

         Borough  total_revenue
0       Brooklyn       96333.24
1      Manhattan       92271.30
2         Queens       78671.71
3          Bronx       32830.09
4        Unknown         728.75
5  Staten Island         342.59

In [44]:
# Question 6. Largest tip
# For the passengers picked up in September 2019 in the zone name Astoria which was the drop off zone that had the largest tip? We want the name of the zone, not the id.
query = """
SELECT a.trip_distance, a.tip_amount, a."PULocationID" , b."Zone" as dropped_zone, c."Zone" as picked_zone
FROM green_taxi_data a
LEFT JOIN taxi_zone b ON a."DOLocationID" = b."LocationID"
LEFT JOIN taxi_zone c ON a."PULocationID" = c."LocationID"
where c."Zone" = 'Astoria'
ORDER BY a.tip_amount DESC;
"""

pd.read_sql(query, con=engine)

,trip_distance,tip_amount,PULocationID,dropped_zone,picked_zone
0,14.05,62.31,7,JFK Airport,Astoria
1,2.18,30.00,7,Woodside,Astoria
2,4.92,28.00,7,Kips Bay,Astoria
3,0.00,25.00,7,NV,Astoria
4,0.00,20.00,7,Astoria,Astoria
...,...,...,...,...,...
18274,1.77,0.00,7,Long Island City/Queens Plaza,Astoria
18275,14.46,0.00,7,JFK Airport,Astoria
18276,1.73,0.00,7,Old Astoria,Astoria
18277,1.92,0.00,7,Steinway,Astoria
18278,1.91,0.00,7,Old Astoria,Astoria

In [50]:
! wget https://github.com/DataTalksClub/nyc-tlc-data/releases/download/green/green_tripdata_2019-09.csv.gz

--2024-12-21 05:36:19--  https://github.com/DataTalksClub/nyc-tlc-data/releases/download/green/green_tripdata_2019-09.csv.gz
Resolving github.com (github.com)... 140.82.116.4
Connecting to github.com (github.com)|140.82.116.4|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://objects.githubusercontent.com/github-production-release-asset-2e65be/513814948/b5af7693-2f26-4bd5-8854-75edeb650bae?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=releaseassetproduction%2F20241221%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20241221T053619Z&X-Amz-Expires=300&X-Amz-Signature=6e7046c5b0fb2e39ff1fc83657d622d65c802a559246ce1dd7ebbd3a2a9f3af1&X-Amz-SignedHeaders=host&response-content-disposition=attachment%3B%20filename%3Dgreen_tripdata_2019-09.csv.gz&response-content-type=application%2Foctet-stream [following]
--2024-12-21 05:36:19--  https://objects.githubusercontent.com/github-production-release-asset-2e65be/513814948/b5af7693-2f26-4bd5-8854-75edeb650bae?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=releaseassetproduction%2F20241221%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20241221T053619Z&X-Amz-Expires=300&X-Amz-Signature=6e7046c5b0fb2e39ff1fc83657d622d65c802a559246ce1dd7ebbd3a2a9f3af1&X-Amz-SignedHeaders=host&response-content-disposition=attachment%3B%20filename%3Dgreen_tripdata_2019-09.csv.gz&response-content-type=application%2Foctet-stream
Resolving objects.githubusercontent.com (objects.githubusercontent.com)... 185.199.109.133, 185.199.110.133, 185.199.111.133, ...
Connecting to objects.githubusercontent.com (objects.githubusercontent.com)|185.199.109.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 7854533 (7.5M) [application/octet-stream]
Saving to: ‘green_tripdata_2019-09.csv.gz’

green_tripdata_2019 100%[===================>]   7.49M  --.-KB/s    in 0.1s

2024-12-21 05:36:20 (60.4 MB/s) - ‘green_tripdata_2019-09.csv.gz’ saved [7854533/7854533]